results_mongo_3/workloada_3nodes_load_4.txt
java -cp /mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/conf:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/conf:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/core-0.17.0.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/HdrHistogram-2.1.4.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/htrace-core4-4.1.0-incubating.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/jackson-core-asl-1.9.4.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/lib/jackson-mapper-asl-1.9.4.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/logback-classic-1.1.2.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/logback-core-1.1.2.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/slf4j-api-1.7.25.jar:/mnt/c/Users/alex/Desktop/cours polymtl/log8430e/tp2/ycsb-0.17.0/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -db site.ycsb.db.MongoDbClient -s -P ../workloads/workloada -P mongodb.properties -load
Command line: -db site.ycsb.db.MongoDbClient -s -P ../workloads/workloada -P mongodb.properties -load
YCSB Client 0.17.0

Loading workload...
Starting test.
2025-11-22 16:24:08:845 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://mongo1:27017,mongo2:27018,mongo3:27019/?replicaSet=rs0
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2025-11-22 16:24:15:334 6 sec: 1000 operations; 153.44 current ops/sec; [CLEANUP: Count=1, Max=5515, Min=5512, Avg=5514, 90=5515, 99=5515, 99.9=5515, 99.99=5515] [INSERT: Count=1000, Max=170111, Min=2888, Avg=5934.26, 90=8271, 99=12767, 99.9=40799, 99.99=170111] 
[OVERALL], RunTime(ms), 6517
[OVERALL], Throughput(ops/sec), 153.44483658124904
[TOTAL_GCS_G1_Young_Generation], Count, 6
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 21
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.322234156820623
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 6
[TOTAL_GC_TIME], Time(ms), 21
[TOTAL_GC_TIME_%], Time(%), 0.322234156820623
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 5514.0
[CLEANUP], MinLatency(us), 5512
[CLEANUP], MaxLatency(us), 5515
[CLEANUP], 95thPercentileLatency(us), 5515
[CLEANUP], 99thPercentileLatency(us), 5515
[INSERT], Operations, 1000
[INSERT], AverageLatency(us), 5934.262
[INSERT], MinLatency(us), 2888
[INSERT], MaxLatency(us), 170111
[INSERT], 95thPercentileLatency(us), 9391
[INSERT], 99thPercentileLatency(us), 12767
[INSERT], Return=OK, 1000